/**
 * بيانات القنوات التقنية العربية - مبادرة رباط التقنية
 */

const CHANNELS_DATA = {
    addAllLink: "https://t.me/addlist/Gg-LFze5N89mMTJk",
    
    channels: [
        {
            name: "الزَّنَاد",
            url: "https://t.me/al_zanad",
            description: "الزَّنَاد هي قناة تقنية عربية، تهدف إلى إثراء المحتوى العربي في مجالات التقنية المتقدمة، مع التركيز على تمكين المستخدم العربي بالأدوات والمعرفة اللازمة في العصر الرقمي."
        },
        {
            name: "مُدَوَّنَة يُوسُف",
            url: "https://t.me/ysh_alsager",
            description: "قناة أشارك فيها أمور تقنية ومواد نافعة على الإنترنت وتحديثات مشاريعي وكتاباتي وأشياء أخرى."
        },
        {
            name: "Gen𓂆Ces",
            url: "https://t.me/GenICes",
            description: "ثقافة برمجية بحته، ومصادر تعليمية باللغة العربية."
        },
        {
            name: "مستودع تقني",
            url: "https://t.me/sunni_tech",
            description: "قناة تقنية مخصصة لأهل السنة، لمشاركة التطبيقات والأدوات المفيدة."
        },
        {
            name: "المهند - مساحة تقنية",
            url: "https://t.me/almuhanad_tech",
            description: "مهندس برمجيات ومطور ويب متكامل شغوف بالتقنية."
        },
        {
            name: "خان المُبرمجين",
            url: "https://t.me/programmerskhan",
            description: "قناة أنشر فيها ما أتعلمه خلال عملي على مشاريعي الخاصة."
        },
        {
            name: "Mohcin Bounouara's Space",
            url: "https://t.me/mohcinspacesoftware",
            description: "خواطر في الدين والدنيا وهندسة البرمجيات."
        },
        {
            name: "حسان زوزو",
            url: "https://t.me/hassenzouzou",
            description: "قناة تقنية أشارك فيها كل ما أراه مفيدًا في عالم التكنولوجيا."
        },
        {
            name: "عاصم آل ناجي",
            url: "https://t.me/AsemNajee",
            description: "ثقافة برمجية بحته، ومصادر تعليمية باللغة العربية."
        },
        {
            name: "محمود نصر الدين",
            url: "https://t.me/Mahmoud_Nasredeen",
            description: "محتوى عن التقنية والإنتاجية وأشياء أخرى."
        },
        {
            name: "دوبــاكــود",
            url: "https://t.me/DopaCode",
            description: "أدوات ومصادر تعليمية مجانية، شروحات مبسّطة، أفكار تقنية جديدة."
        },
        {
            name: "01",
            url: "https://t.me/computersInfo",
            description: "مقتطفات حاسوبية، تهم المبرمجين والمصممين وطلبة الحاسوب."
        },
        {
            name: "AI Tools Hub | ذكاء اصطناعي مجاناً",
            url: "https://t.me/AiTools6",
            description: "بوابتك المجانية لعالم الذكاء الاصطناعي."
        },
    ]
};
